Autodesk.Revit.UI.PostableCommand
Enumerates all of the built-in commands which can be posted by an API application.
Since:
2014

Autodesk.Revit.UI.PostableCommand.StatusBar
Displays the status bar at the bottom of the Revit window.

Autodesk.Revit.UI.PostableCommand.ExitRevit
Exit Revit.

Autodesk.Revit.UI.PostableCommand.CanvasTheme
Sets the color theme of the canvas to dark or light.

Autodesk.Revit.UI.PostableCommand.TileViews
Arranges all open views within the application window, tiled so you can see each one in the drawing area.

Autodesk.Revit.UI.PostableCommand.TabViews
Arranges all open views in the drawing area as tabs in a single window.

Autodesk.Revit.UI.PostableCommand.PasteFromClipboard
Pastes elements from the clipboard into the current view.

Autodesk.Revit.UI.PostableCommand.CutToClipboard
Removes selected elements, and places them on the clipboard.

Autodesk.Revit.UI.PostableCommand.CopyToClipboard
Copies selected elements to the clipboard.

Autodesk.Revit.UI.PostableCommand.PrintPreview
Displays a preview version of the current view or sheet to print.

Autodesk.Revit.UI.PostableCommand.Print
Sends the current drawing area or selected views and sheets to a printer or a printable file.

Autodesk.Revit.UI.PostableCommand.PrintSetup
Specifies print options.

Autodesk.Revit.UI.PostableCommand.SaveAsProject
Saves the current Revit project file.

Autodesk.Revit.UI.PostableCommand.Save
Saves the currently open project file.

Autodesk.Revit.UI.PostableCommand.Close
Close Revit.

Autodesk.Revit.UI.PostableCommand.OpenRevitFile
Opens any Revit file type.

Autodesk.Revit.UI.PostableCommand.AddInsManager
Opens the Add-Ins Manager dialog, where you can enable and disable add-ins.

Autodesk.Revit.UI.PostableCommand.LinkTopography
Links existing topography to the current Revit model.

Autodesk.Revit.UI.PostableCommand.RepairCentralModel
Repairs a corrupt central model.

Autodesk.Revit.UI.PostableCommand.DynamoPlayer
Preview, select, and run your Dynamo graphs from a single dialog.

Autodesk.Revit.UI.PostableCommand.SpaceNaming
Assigns the names and numbers from architectural rooms to MEP spaces used for building performance analysis.

Autodesk.Revit.UI.PostableCommand.SubstitutionSettings
Opens the Twinmotion Substitution Settings dialog.

Autodesk.Revit.UI.PostableCommand.LaunchInDockedWindow
Access the Content Catalog in the Revit session from a docked window.

Autodesk.Revit.UI.PostableCommand.LaunchInBrowser
Access the Content Catalog in the default browser.

Autodesk.Revit.UI.PostableCommand.LaunchAsApp
Open the Content Catalog in a separate window.

Autodesk.Revit.UI.PostableCommand.ToposolidSmoothShading
Display toposolid elements in the model with smoothed surfaces.

Autodesk.Revit.UI.PostableCommand.OperatingSchedules
Opens the Building Operation Schedules Editor.

Autodesk.Revit.UI.PostableCommand.ToposolidByFace
Creates an element using a non-vertical face of a mass.

Autodesk.Revit.UI.PostableCommand.CoordinationModelChanges
Displays the overview of changes between the current version of a linked coordination model from Autodesk Docs and any of its previous versions.

Autodesk.Revit.UI.PostableCommand.PDF
Creates PDF files.

Autodesk.Revit.UI.PostableCommand.PropertyLineData
Define the angle display and units used when creating and labeling property lines.

Autodesk.Revit.UI.PostableCommand.Loads
Defines point, line, and area loads in an analytical model.

Autodesk.Revit.UI.PostableCommand.CoordinationModelAutodeskDocs
Links a coordination model view from Autodesk Docs into the current project.

Autodesk.Revit.UI.PostableCommand.CoordinationModelLocal
Links a NWD or NWC file to provide context for the Revit model.

Autodesk.Revit.UI.PostableCommand.PanelByExtrusion
Creates an analytical panel perpendicular to the current work plane after a sketch of the path.

Autodesk.Revit.UI.PostableCommand.RebarBendingDetail
Creates realistic or schematic bar bending details for the selected individual rebar or sets.

Autodesk.Revit.UI.PostableCommand.AnalyticalAutomation
Automates the creation, element connection, and update of the analytical model, using the physical representation as context.

Autodesk.Revit.UI.PostableCommand.CreateFromImport
Creates a solid topographical element.

Autodesk.Revit.UI.PostableCommand.Toposolid
Creates a solid topographical element.

Autodesk.Revit.UI.PostableCommand.PanelByBoundary
Creates a planar analytical panel for the current work plane after a sketch of the contour.

Autodesk.Revit.UI.PostableCommand.DynamoPlayerForSteel
Places steel connections on selected elements using pre-defined rules.

Autodesk.Revit.UI.PostableCommand.OpenCloudModel
Opens a Revit cloud model.

Autodesk.Revit.UI.PostableCommand.ElectricalAnalyticalLoadTypeSettings
Opens the Electrical Analytical Load Type Settings dialog to define the power requirement for area-based loads.

Autodesk.Revit.UI.PostableCommand.ResetSharedCoordinates
Eliminate shared coordinates in the host model.

Autodesk.Revit.UI.PostableCommand.SharedViews
Opens and closes the Shared Views palette.

Autodesk.Revit.UI.PostableCommand.WorksharingMonitor
Launches Worksharing Monitor to manage a file-based workshared model.

Autodesk.Revit.UI.PostableCommand.BatchPrint
Print a large number of drawings with a batch job.

Autodesk.Revit.UI.PostableCommand.AnalyticalMember
Places an analytical member in the project.

Autodesk.Revit.UI.PostableCommand.LinkImage
Inserts a link to an image into a model view.

Autodesk.Revit.UI.PostableCommand.LinkPDF
Inserts a link to a PDF into a model view.

Autodesk.Revit.UI.PostableCommand.SystemsAnalysis
Performs a systems analysis and generates a report for whole building energy simulation and analysis.

Autodesk.Revit.UI.PostableCommand.SaveAsCloudModel
Saves the current Revit model to the cloud.

Autodesk.Revit.UI.PostableCommand.ToggleHome
Toggle Revit Home.

Autodesk.Revit.UI.PostableCommand.CutBy
Creates a cut on a model element along the shape of another intersecting model element and a cut through the intersecting element. The connection between the two elements is also created.

Autodesk.Revit.UI.PostableCommand.CutThrough
Creates a cut through a model element around the contour of another intersecting model element. The weld between the two elements is also created.

Autodesk.Revit.UI.PostableCommand.SawCutWeb
Creates a cut on a beam adjusted according to the web of another intersecting beam and the related connection between the beams.

Autodesk.Revit.UI.PostableCommand.SawCutFlange
Creates a cut on a beam adjusted according to the flange of another intersecting beam and the related connection between the beams.

Autodesk.Revit.UI.PostableCommand.Miter
Creates a miter cut vertically or at the bisecting line of two beams and the related connection between the beams.

Autodesk.Revit.UI.PostableCommand.Cope
Creates a parametric cope on intersecting beams and the related connection between the beams.

Autodesk.Revit.UI.PostableCommand.ContourCut
Creates a contour cut on the selected faces of a beam or a plate.

Autodesk.Revit.UI.PostableCommand.ShearStuds
Creates shear studs and the related welds on the selected face of model elements.

Autodesk.Revit.UI.PostableCommand.Anchors
Inserts anchors and the related holes in the selected model elements.

Autodesk.Revit.UI.PostableCommand.Holes
Inserts holes on the selected face of model elements.

Autodesk.Revit.UI.PostableCommand.Bolts
Inserts bolts and the related holes in the selected model elements.

Autodesk.Revit.UI.PostableCommand.Plate
Creates a structural plate in the building model.

Autodesk.Revit.UI.PostableCommand.Welds
Inserts a weld on one of the available edges of the model elements to be connected.

Autodesk.Revit.UI.PostableCommand.CornerCut
Creates a cut on the corner of a selected plate.

Autodesk.Revit.UI.PostableCommand.CopeSkewed
Creates a skewed cope at the selected beam end, either at the top or at the bottom.

Autodesk.Revit.UI.PostableCommand.Shorten
Creates a shorten object on the selected beam that can trim or extend the beam.

Autodesk.Revit.UI.PostableCommand.DeleteEnergyModel
Removes the energy analytical model from the Revit project.

Autodesk.Revit.UI.PostableCommand.Dynamo
Provides access to Dynamo, an open source visual programming platform for designers.

Autodesk.Revit.UI.PostableCommand.LoadRebarShapeIntoProjectAndClose
Loads the rebar shape into open projects or family files and closes the family after it loads.

Autodesk.Revit.UI.PostableCommand.FabricationPart
Displays the MEP Fabrication Parts palette.

Autodesk.Revit.UI.PostableCommand.LoadFamilyIntoProjectAndClose
Loads the family into open projects or family files and closes the family after it loads.

Autodesk.Revit.UI.PostableCommand.SpatialGrid
Place a square or hexagonal grid in a room element.

Autodesk.Revit.UI.PostableCommand.PeopleContent
Place a family to indicate a person and a physical distance radius into the view.

Autodesk.Revit.UI.PostableCommand.OneWayIndicator
Place a one-way annotation family into the view.

Autodesk.Revit.UI.PostableCommand.MultiplePaths
Places multiple paths of travel between two selected points using a specified minimum path separation for each path.

Autodesk.Revit.UI.PostableCommand.MultipleValuesIndication
Specifies the value indicated for a parameter when multiple elements with different parameter values are selected.

Autodesk.Revit.UI.PostableCommand.PathOfTravel
Creates a path of travel along the shortest distance between 2 selected points.

Autodesk.Revit.UI.PostableCommand.RevealObstacles
Highlights categories that are considered obstacles in the view.

Autodesk.Revit.UI.PostableCommand.AssemblyCode
Specifies the location of the assembly code file or reloads the assembly code table from the current file.

Autodesk.Revit.UI.PostableCommand.PublishSettings
Selects the views and sheets to publish to the cloud.

Autodesk.Revit.UI.PostableCommand.CollaborateInCloud
Enables collaboration in the cloud, which allows team members to work on a model simultaneously.

Autodesk.Revit.UI.PostableCommand.Collaborate
Enables collaboration so team members can work on a model simultaneously.

Autodesk.Revit.UI.PostableCommand.GlobalParameters
Specifies parameters that can be added to a project, and used to define values of other parameters.

Autodesk.Revit.UI.PostableCommand.DisplaceElements
Creates a view-specific representation of model elements that can be displaced in the view.

Autodesk.Revit.UI.PostableCommand.CreateEnergyModel
Creates the energy analytical model.

Autodesk.Revit.UI.PostableCommand.RenderGallery
Opens your online gallery of completed and in-progress renderings in a web browser.

Autodesk.Revit.UI.PostableCommand.RenderInCloud
Renders 3D views online to create still images or interactive panoramas.

Autodesk.Revit.UI.PostableCommand.ManageConnectionToARevitServerAccelerator
Specifies the Revit Server Accelerator to use for worksharing, or changes the accelerator to which you are connected.

Autodesk.Revit.UI.PostableCommand.StairTreadOrRiserNumber
Creates a sequence of tread or riser numbers for a run in plan, elevation, or section views.

Autodesk.Revit.UI.PostableCommand.CreateAssembly
Creates an assembly from elements you select in the drawing area.

Autodesk.Revit.UI.PostableCommand.GuideGrid
Creates a new guide element in the active sheet to help align elements within and between sheets.

Autodesk.Revit.UI.PostableCommand.ExportGBXML
Saves the model as a gbXML file.

Autodesk.Revit.UI.PostableCommand.EnergySettings
Specifies parameters used to create the energy analytical model.

Autodesk.Revit.UI.PostableCommand.FindOrReplace
Finds and replaces text in an open project file.

Autodesk.Revit.UI.PostableCommand.LoadsScalingDisplay
Overrides the load type graphics scale using the project scale.

Autodesk.Revit.UI.PostableCommand.BoundaryConditionsSettings
Selects the family symbol and adjusts the spacing for boundary conditions.

Autodesk.Revit.UI.PostableCommand.LoadCasesAndCombinations
Adds and edits load combinations for the analytical model.

Autodesk.Revit.UI.PostableCommand.LoadCasesDisplay
Adds and edits load cases for the analytical model.

Autodesk.Revit.UI.PostableCommand.OpenProject
Opens a Revit project.

Autodesk.Revit.UI.PostableCommand.Multiplanar
Toggles the ability to define a rebar shape bent in more than one plane.

Autodesk.Revit.UI.PostableCommand.HalftoneOrUnderlay
Customizes halftone and underlay elements in view.

Autodesk.Revit.UI.PostableCommand.SaveAsFamily
Saves the current family.

Autodesk.Revit.UI.PostableCommand.SaveAsTemplate
Saves the current Revit project file as a template.

Autodesk.Revit.UI.PostableCommand.BeamOrColumnJoins
Adjusts how beams and columns frame into one another.

Autodesk.Revit.UI.PostableCommand.KeyboardShortcuts
Assigns key sequences to tools.

Autodesk.Revit.UI.PostableCommand.MirrorDrawAxis
Draws a temporary line to use as an axis for mirroring.

Autodesk.Revit.UI.PostableCommand.MeasureAlongAnElement
Measures the length of an element.

Autodesk.Revit.UI.PostableCommand.MeasureBetweenTwoReferences
Measures the distance between two elements or references.

Autodesk.Revit.UI.PostableCommand.ArcLengthDimension
Places a dimension that measures the length of a curved wall or other element.

Autodesk.Revit.UI.PostableCommand.RadialDimension
Places a dimension that measures the radius of an inner curve or fillet.

Autodesk.Revit.UI.PostableCommand.AngularDimension
Places a dimension that measures the angle between reference points sharing a common intersection.

Autodesk.Revit.UI.PostableCommand.LinearDimension
Places horizontal or vertical dimensions that measure the distance between reference points.

Autodesk.Revit.UI.PostableCommand.AlignedDimension
Places dimensions between parallel references, or between multiple points.

Autodesk.Revit.UI.PostableCommand.TrimOrExtendMultipleElements
Trims or extends multiple elements (such as walls, lines, and beams) to a boundary defined by another element.

Autodesk.Revit.UI.PostableCommand.TrimOrExtendSingleElement
Trims or extends one element (such as a wall, line, or beam) to a boundary defined by another element.

Autodesk.Revit.UI.PostableCommand.TrimOrExtendToCorner
Trims or extends elements (such as walls or beams) to form a corner.

Autodesk.Revit.UI.PostableCommand.AnalyticalLink
Creates an analytical element that connects two separate analytical nodes.

Autodesk.Revit.UI.PostableCommand.ColorSchemes
Creates or modifies a color fill scheme for rooms and areas.

Autodesk.Revit.UI.PostableCommand.EditRebarCover
Edits the rebar cover references of an entire rebar host or an individual face.

Autodesk.Revit.UI.PostableCommand.VoidSweptBlend
Creates a blend that sweeps along a defined path, and uses the resulting 3D shape to remove part of a solid 3D shape.

Autodesk.Revit.UI.PostableCommand.SolidSweptBlend
Creates a blend that sweeps along a defined path.

Autodesk.Revit.UI.PostableCommand.AreaReinforcementSymbol
Places a symbol that shows extents and hook types for the selected area reinforcement.

Autodesk.Revit.UI.PostableCommand.StructuralAreaReinforcement
Sketches the boundary of an area to populate with rebar.

Autodesk.Revit.UI.PostableCommand.BeamSystemSymbol
Places a beam system span tag.

Autodesk.Revit.UI.PostableCommand.RemoveCoping
Removes coping from steel beams and columns.

Autodesk.Revit.UI.PostableCommand.ApplyCoping
Adds coping to steel beams and columns.

Autodesk.Revit.UI.PostableCommand.GraphicalColumnSchedule
Creates a graphical column schedule for the project.

Autodesk.Revit.UI.PostableCommand.ShowLastReport
Displays the most recent interference check report.

Autodesk.Revit.UI.PostableCommand.HideBoundaryOpenEnds
Hides dots that display on the open ends of area based load boundary lines.

Autodesk.Revit.UI.PostableCommand.PlumbingEquipment
Places plumbing equipment such as hot water heaters, domestic water pumps, and sewage pumps.

Autodesk.Revit.UI.PostableCommand.MechanicalControlDevice
Places a mechanical control device such as thermostats, CO2 sensors, and humidistats.

Autodesk.Revit.UI.PostableCommand.ShowBoundaryOpenEnds
Displays dots on the open ends of area based load boundary lines.

Autodesk.Revit.UI.PostableCommand.MEPFabricationDuctworkStiffener
Places a stiffener on fabrication ductwork.

Autodesk.Revit.UI.PostableCommand.EquipmentLoad
Opens the System Browser to define equipment loads, such as a chiller or other specific equipment.

Autodesk.Revit.UI.PostableCommand.AreaBasedLoadBoundary
Places a boundary line for electrical area based loads.

Autodesk.Revit.UI.PostableCommand.CreateAnAreaBasedLoad
Creates an area based load from the area defined by the area based load boundaries.

Autodesk.Revit.UI.PostableCommand.StructuralTrusses
Adds a truss to the structure model.

Autodesk.Revit.UI.PostableCommand.SynchronizeNow
Updates a local copy of a workshared project using settings from the Synchronize with Central dialog.

Autodesk.Revit.UI.PostableCommand.InPlaceMass
Creates a mass that is unique to the project.

Autodesk.Revit.UI.PostableCommand.PlaceMass
Places an instance of a mass family in the project.

Autodesk.Revit.UI.PostableCommand.AutomaticBeamSystem
Creates a layout that is used to control the number and spacing of a series of parallel beams.

Autodesk.Revit.UI.PostableCommand.SaveAsLibraryView
Saves a copy of all loaded families, the selected family, group, or view to your library.

Autodesk.Revit.UI.PostableCommand.Insert2DElementsFromFile
Copies 2D elements from a detail view (saved in another project) into a detail view in the current project.

Autodesk.Revit.UI.PostableCommand.InsertViewsFromFile
Copies specified views (sheets, schedules, or drafting views) from a project file and saves them in the current project.

Autodesk.Revit.UI.PostableCommand.RepeatingDetailComponent
Repeats a detail component along a path.

Autodesk.Revit.UI.PostableCommand.CheckSpelling
Checks the spelling of text notes in a selection or in the current view or sheet.

Autodesk.Revit.UI.PostableCommand.SlabEdgeFloor
Shapes the horizontal edge of a floor slab.

Autodesk.Revit.UI.PostableCommand.Gutter
Adds a gutter to the edge of a roof, soffit, or fascia, or to model lines.

Autodesk.Revit.UI.PostableCommand.Fascia
Adds fascia to the edge of a roof, soffit, or other fascia, or to model lines.

Autodesk.Revit.UI.PostableCommand.ShowWorkPlane
Displays or hides the active work plane in the view.

Autodesk.Revit.UI.PostableCommand.AreaAndVolumeComputations
Specifies how areas and volumes are calculated, and creates area schemes.

Autodesk.Revit.UI.PostableCommand.SiteComponent
Adds site-specific elements, such as trees, parking islands, and fire hydrants.

Autodesk.Revit.UI.PostableCommand.SystemZone
Create a system-zone for analytical spaces.

Autodesk.Revit.UI.PostableCommand.MultiPointRouting
Automatically build a run of connected MEP fabrication parts by clicking points in the model.

Autodesk.Revit.UI.PostableCommand.ShowDisconnects
Controls the display of graphical disconnect warnings for duct, pipe, conduit, cable tray, electrical circuits, and fabrication hangers.

Autodesk.Revit.UI.PostableCommand.ParallelPipes
Creates parallel runs of pipe based on an initial pipe run.

Autodesk.Revit.UI.PostableCommand.PipePlaceholder
Draws placeholder pipe without elbow or tee fittings.

Autodesk.Revit.UI.PostableCommand.DuctPlaceholder
Draws placeholder duct without elbow or tee fittings.

Autodesk.Revit.UI.PostableCommand.ParallelConduits
Creates parallel runs of conduit based on an initial conduit run.

Autodesk.Revit.UI.PostableCommand.EditATemplate
Modifies a specific panel schedule template.

Autodesk.Revit.UI.PostableCommand.ManageTemplates
Manages and applies panel schedule templates to existing schedules in the project.

Autodesk.Revit.UI.PostableCommand.Conduit
Draws rigid conduit runs.

Autodesk.Revit.UI.PostableCommand.CableTray
Draws cable tray runs such as rigid ladder or channel cable tray.

Autodesk.Revit.UI.PostableCommand.ConduitFitting
Places a conduit fitting. These fittings include elbows, tees, wyes, crosses, and other unions.

Autodesk.Revit.UI.PostableCommand.CableTrayFitting
Places a cable tray fitting. These fittings include elbows, tees, wyes, crosses, and other unions.

Autodesk.Revit.UI.PostableCommand.ConduitConnector
Adds a conduit connector to a component.

Autodesk.Revit.UI.PostableCommand.CableTrayConnector
Adds a cable tray connector to a component.

Autodesk.Revit.UI.PostableCommand.Telephone
Places a telephone jack.

Autodesk.Revit.UI.PostableCommand.Security
Places security devices such as door locks, motion sensors, and surveillance cameras.

Autodesk.Revit.UI.PostableCommand.NurseCall
Places nurse call devices such as call stations, code blue stations, and door lights.

Autodesk.Revit.UI.PostableCommand.Lighting
Places lighting switches such as daylight sensors, occupancy sensors, and manual switches.

Autodesk.Revit.UI.PostableCommand.FireAlarm
Places fire alarm devices such as smoke detectors, manual pull stations, and annunciators.

Autodesk.Revit.UI.PostableCommand.Data
Places data devices such as ethernet and other network connections.

Autodesk.Revit.UI.PostableCommand.Communication
Places communication devices such as intercom system components.

Autodesk.Revit.UI.PostableCommand.SplineWire
Draws splined wire runs.

Autodesk.Revit.UI.PostableCommand.ChamferedWire
Draws chamfered wire runs.

Autodesk.Revit.UI.PostableCommand.BuildingOrSpaceTypeSettings
Opens the Building and Space Type Settings dialog to manage building and space parameters and schedules.

Autodesk.Revit.UI.PostableCommand.Zone
Defines HVAC zones within a project.

Autodesk.Revit.UI.PostableCommand.PipeConnector
Adds a pipe connector to a component.

Autodesk.Revit.UI.PostableCommand.DuctConnector
Adds a duct connector to a component.

Autodesk.Revit.UI.PostableCommand.ElectricalConnector
Adds an electrical connector to a component.

Autodesk.Revit.UI.PostableCommand.Sprinkler
Places a sprinkler.

Autodesk.Revit.UI.PostableCommand.PlumbingFixture
Places plumbing fixtures. These fixtures include sinks, water closets, tubs, drains, and various appliances.

Autodesk.Revit.UI.PostableCommand.MechanicalSettings
Opens the Mechanical Settings dialog.

Autodesk.Revit.UI.PostableCommand.CheckDuctSystems
Verifies all duct systems for properly connected ductwork and valid system assignments.

Autodesk.Revit.UI.PostableCommand.CheckPipeSystems
Verifies all pipe systems for properly connected pipes and valid system assignments.

Autodesk.Revit.UI.PostableCommand.PipeLegend
Places a legend to indicate the color fills associated with piping systems.

Autodesk.Revit.UI.PostableCommand.ArcWire
Draws arced wire runs.

Autodesk.Revit.UI.PostableCommand.PipeAccessory
Places a pipe accessory. These accessories include connectors, valves, and inline water heaters.

Autodesk.Revit.UI.PostableCommand.PipeFitting
Places a pipe fitting. These fittings include elbows, tees, wyes, crosses, unions, and other types of fittings.

Autodesk.Revit.UI.PostableCommand.FlexPipe
Draws flexible piping.

Autodesk.Revit.UI.PostableCommand.Pipe
Draws rigid piping.

Autodesk.Revit.UI.PostableCommand.DemandFactors
Applies demand factors to a panel.

Autodesk.Revit.UI.PostableCommand.CheckCircuits
Verifies all circuits for proper connections to panels and valid system assignments. Errors are reported in a warning dialog.

Autodesk.Revit.UI.PostableCommand.ElectricalFixture
Places electrical devices such as receptacles, junction boxes, and other power devices.

Autodesk.Revit.UI.PostableCommand.ElectricalEquipment
Places electrical equipment such as panels and switch gear.

Autodesk.Revit.UI.PostableCommand.LightingFixture
Places lighting fixtures such as ceiling, wall, and recessed lights.

Autodesk.Revit.UI.PostableCommand.LoadClassifications
Assigns and specifies demand factors to a load classification.

Autodesk.Revit.UI.PostableCommand.ElectricalSettings
Opens the Electrical Settings dialog to define distribution systems, wire types, cable tray and conduit sizes, and demand factors.

Autodesk.Revit.UI.PostableCommand.PanelSchedules
Generates a panel schedule for a specified panel.

Autodesk.Revit.UI.PostableCommand.DuctLegend
Places a legend to indicate the color fills associated with ductwork in duct systems.

Autodesk.Revit.UI.PostableCommand.ConvertToFlexDuct
Changes a length of ductwork connected to an air terminal from rigid duct to flexible duct.

Autodesk.Revit.UI.PostableCommand.FlexDuct
Draws round and rectangular flexible ductwork.

Autodesk.Revit.UI.PostableCommand.DuctFitting
Places a duct fitting. These fittings include elbows, tees, wyes, crosses, and other types of fittings.

Autodesk.Revit.UI.PostableCommand.MechanicalEquipment
Places mechanical equipment such as boilers, furnaces, or fans.

Autodesk.Revit.UI.PostableCommand.Duct
Draws rigid round, rectangular, or oval ductwork.

Autodesk.Revit.UI.PostableCommand.AirTerminal
Places a register, grille, or diffuser.

Autodesk.Revit.UI.PostableCommand.DuctAccessory
Places a duct accessory. These accessories include dampers, filters and smoke detectors.

Autodesk.Revit.UI.PostableCommand.ReCenterReference
Move the reference lines of all of the rooms in the view back to the center of the rooms.

Autodesk.Revit.UI.PostableCommand.TogglePAndIDModelerBrowser
Toggle P&ID Modeler browser.

Autodesk.Revit.UI.PostableCommand.PAndIDSettings
Manage the mappings between elements, such as services and families, between the P&ID drawing and the Revit model.

Autodesk.Revit.UI.PostableCommand.PAndIDModeler
Create a 3D piping model directly from a 2D P&ID drawing in the cloud.

Autodesk.Revit.UI.PostableCommand.InsertCoupler
Places a reinforcement coupler element to join rebar in a host.

Autodesk.Revit.UI.PostableCommand.SelectionBox
Isolates selected elements in the current view (if a 3D isometric view) or the default 3D view.

Autodesk.Revit.UI.PostableCommand.LinkIFC
Links an IFC file to the current project to reference its information for additional design work.

Autodesk.Revit.UI.PostableCommand.FabricationSettings
Opens the Fabrication Settings dialog.

Autodesk.Revit.UI.PostableCommand.LinearMultiRebarAnnotation
Tags multiple elements with a single annotation that displays linear dimensions between references as well as parameters from the referenced elements. For example, all rebar in a rebar set can be referenced with a single tag.

Autodesk.Revit.UI.PostableCommand.AlignedMultiRebarAnnotation
Tags multiple elements with a single annotation that displays aligned dimensions between references as well as parameters from the referenced elements. For example, all rebar in a rebar set can be referenced with a single tag.

Autodesk.Revit.UI.PostableCommand.SingleFabricSheetPlacement
Places a single fabric sheet on floors, walls, and foundation slabs.

Autodesk.Revit.UI.PostableCommand.OpenSampleFiles
Opens a Revit sample file.

Autodesk.Revit.UI.PostableCommand.PipePressureLossReport
Generates a pressure loss report for one or more pipe systems.

Autodesk.Revit.UI.PostableCommand.DuctPressureLossReport
Generates a pressure loss report for one or more duct systems.

Autodesk.Revit.UI.PostableCommand.PlaceOnStairOrRamp
Places a railing on a stair or ramp.

Autodesk.Revit.UI.PostableCommand.FabricReinforcementSymbol
Located on the Symbol panel of the Annotate tab.Places a symbol that represents the fabric sheet.

Autodesk.Revit.UI.PostableCommand.StructuralFabricArea
Located on the Reinforcement panel of the Structure tab (or Modify tab for floors, walls and foundation slabs).Sketches the boundary of a fabric area to populate with fabric sheets.

Autodesk.Revit.UI.PostableCommand.DiameterDimensionTypes
Defines attributes for diameter dimensions.

Autodesk.Revit.UI.PostableCommand.DiameterDimension
Places a dimension that measures the diameter of an arc or circle.

Autodesk.Revit.UI.PostableCommand.ReconcileHosting
Lists tags and elements hosted by the linked model that require review, due to changes in the linked model.

Autodesk.Revit.UI.PostableCommand.FormWorkPlaneView
Enables the Workplane Viewer.

Autodesk.Revit.UI.PostableCommand.NavigationBar
Shows or hides the navigation bar, which provides access to the ViewCube, SteeringWheels, and zoom/pan functions.

Autodesk.Revit.UI.PostableCommand.MacroSecurity
Specifies the default security settings for macros in the Revit application.

Autodesk.Revit.UI.PostableCommand.MacroManager
Opens the Macro Manager to run, create, or delete a macro.

Autodesk.Revit.UI.PostableCommand.AllowableBarTypes
Defines the allowable rebar types (diameters) of the shape type.

Autodesk.Revit.UI.PostableCommand.BeamAnnotations
Places multiple beam tags, annotations, and spot elevations.

Autodesk.Revit.UI.PostableCommand.ViewCube
Shows or hides the ViewCube, which allows you to change the orientation of a 3D view.

Autodesk.Revit.UI.PostableCommand.CreateParts
Creates parts from the layers or subcomponents of a selected element.

Autodesk.Revit.UI.PostableCommand.OpenFamily
Opens a Revit family.

Autodesk.Revit.UI.PostableCommand.ExportFBX
Saves a 3D view as an FBX file.

Autodesk.Revit.UI.PostableCommand.ReinforcementSettings
Customizes reinforcement settings such as rounding parameters, rebar hosting and abbreviations of area/path reinforcement tagging.

Autodesk.Revit.UI.PostableCommand.MajorSegment
Identifies one segment of the rebar shape that maintains its general position in rotation and auto-expansion behaviors.

Autodesk.Revit.UI.PostableCommand.MaskingRegion
Creates a graphic that obscures elements in a project or family.

Autodesk.Revit.UI.PostableCommand.DuplicateAsDependent
Creates a view that is dependent on the original view.

Autodesk.Revit.UI.PostableCommand.OverrideByFilter
Changes the graphic display settings for all elements in the view that meet the criteria specified in a filter.

Autodesk.Revit.UI.PostableCommand.OverrideByElement
Changes the graphic display settings for selected elements in the current view.

Autodesk.Revit.UI.PostableCommand.ToggleRevealHiddenElementsMode
Toggle reveal hidden elements mode.

Autodesk.Revit.UI.PostableCommand.HideElements
Hides selected elements in the current view.

Autodesk.Revit.UI.PostableCommand.SpotSlope
Displays the slope at a specific point on a face or an edge of a model element.

Autodesk.Revit.UI.PostableCommand.ShaftOpening
Creates a vertical opening that spans multiple levels, cutting through intervening roofs, floors, and ceilings.

Autodesk.Revit.UI.PostableCommand.WallOpening
Cuts a rectangular opening in a straight or curved wall.

Autodesk.Revit.UI.PostableCommand.DormerOpening
Cuts a roof to create an opening for a dormer.

Autodesk.Revit.UI.PostableCommand.VerticalOpening
Cuts a vertical opening through a roof, floor, or ceiling.

Autodesk.Revit.UI.PostableCommand.OpeningByFace
Creates an opening that is perpendicular to the selected face of a roof, floor, or ceiling.

Autodesk.Revit.UI.PostableCommand.PathReinforcementSymbol
Places a symbol that shows extents and hook types for the selected path reinforcement.

Autodesk.Revit.UI.PostableCommand.StructuralPathReinforcement
Sketches the path of evenly placed reinforcing bars that are created perpendicular to the sketch.

Autodesk.Revit.UI.PostableCommand.BoundaryConditions
Defines point, line, and area boundary conditions in an analytical model.

Autodesk.Revit.UI.PostableCommand.MultiCategoryTag
Attaches tags to elements of multiple categories, based on a shared parameter.

Autodesk.Revit.UI.PostableCommand.ShowWorksharingMakeEditableControls
Enables/Disables display of "Make Editable" controls when elements are selected.

Autodesk.Revit.UI.PostableCommand.ActivateControlsAndDimensions
Enable or disable the visibility of pins, constraints, and temporary dimensions when multiple elements are selected.

Autodesk.Revit.UI.PostableCommand.EditSelection
Edits a previously saved selection set.

Autodesk.Revit.UI.PostableCommand.SaveSelection
Saves the currently selected elements as a set.

Autodesk.Revit.UI.PostableCommand.LoadSelection
Loads a previously saved selection set.

Autodesk.Revit.UI.PostableCommand.UserKeynote
Tags an element with a keynote that you select.

Autodesk.Revit.UI.PostableCommand.MaterialKeynote
Tags a selected element using the keynote specified for its material.

Autodesk.Revit.UI.PostableCommand.ElementKeynote
Tags a selected element using the keynote specified for the element type.

Autodesk.Revit.UI.PostableCommand.Slab
Adds a foundation slab to the building model.

Autodesk.Revit.UI.PostableCommand.CoordinationSettings
Specifies mapping behavior when copying MEP fixtures from a linked model into the current project.

Autodesk.Revit.UI.PostableCommand.MaterialTag
Tags a selected element using the description specified for its material.

Autodesk.Revit.UI.PostableCommand.Isolated
Adds footings or pile caps to the building model.

Autodesk.Revit.UI.PostableCommand.Wall
Creates foundations hosted by walls.

Autodesk.Revit.UI.PostableCommand.CoordinationSelectLink
Displays warnings for monitored elements between linked projects and the host project.

Autodesk.Revit.UI.PostableCommand.CoordinationReviewUseCurrentProject
Displays warnings for monitored elements in the current project.

Autodesk.Revit.UI.PostableCommand.CopyMonitorSelectLink
Copies selected elements from a linked project to the host project, and monitors changes to these elements.

Autodesk.Revit.UI.PostableCommand.CopyMonitorUseCurrentProject
Monitors grids, levels, columns, walls, floors, and openings within the current project.

Autodesk.Revit.UI.PostableCommand.StructuralRebar
Places planar, multi-planar or free form rebar.

Autodesk.Revit.UI.PostableCommand.ShowMassZonesAndShades
Displays mass zones, glazing, and shades if they have been specified.

Autodesk.Revit.UI.PostableCommand.ShowMassSurfaceTypes
Displays mass faces, including any glazing and shades that have been specified.

Autodesk.Revit.UI.PostableCommand.ShowMassByViewSettings
Displays masses based on the settings for the current view. By default, masses are turned off.

Autodesk.Revit.UI.PostableCommand.WallByFaceWall
Creates walls using faces of a mass or generic model.

Autodesk.Revit.UI.PostableCommand.CurtainSystemByFace
Creates a curtain system on the face of a mass or generic model.

Autodesk.Revit.UI.PostableCommand.ShowMassFormAndFloors
Displays mass forms and any mass floors you have specified in all views.

Autodesk.Revit.UI.PostableCommand.RebarCoverSettings
Adds, removes, or modifies the default rebar cover settings.

Autodesk.Revit.UI.PostableCommand.ReferenceLine
Creates a reference line that you can use when creating a new family, or to create constraints for the family.

Autodesk.Revit.UI.PostableCommand.StructuralSettings
Defines settings for analytical elements and the display of structural framing.

Autodesk.Revit.UI.PostableCommand.Scale
Resizes the selected item.

Autodesk.Revit.UI.PostableCommand.StructuralFloor
Creates a structural floor (slab) for the current level of the building model.

Autodesk.Revit.UI.PostableCommand.SpanDirectionSymbol
Places a span direction symbol on a structural floor.

Autodesk.Revit.UI.PostableCommand.StructuralWall
Creates a load-bearing or shear wall in the building model.

Autodesk.Revit.UI.PostableCommand.StructuralColumn
Adds a vertical load-bearing element to the building model.

Autodesk.Revit.UI.PostableCommand.Brace
Adds diagonal structural members connected to beams and columns.

Autodesk.Revit.UI.PostableCommand.Beam
Adds individual beams, a chain of beams, or beams along grid lines.

Autodesk.Revit.UI.PostableCommand.Railing
Creates a railing by sketching the railing path.

Autodesk.Revit.UI.PostableCommand.SaveAsLibraryFamily
Saves a copy of all loaded families, the selected family, group, or view to your library.

Autodesk.Revit.UI.PostableCommand.EditingRequests
Displays a list of other users' requests to borrow elements in your worksets, and your pending requests.

Autodesk.Revit.UI.PostableCommand.PickToEdit
Opens a design option for editing by selecting an element contained in the option.

Autodesk.Revit.UI.PostableCommand.AddToSet
Moves selected elements from the main model to one or more design options in a set.

Autodesk.Revit.UI.PostableCommand.DesignOptions
Creates and manages design option sets and individual design options for the project.

Autodesk.Revit.UI.PostableCommand.ViewReference
Adds an annotation indicating the sheet number and detail number for a selected view.

Autodesk.Revit.UI.PostableCommand.Matchline
Adds matchlines to indicate where a view is split.

Autodesk.Revit.UI.PostableCommand.BrowserOrganization
Changes the way that views are listed in the Project Browser.

Autodesk.Revit.UI.PostableCommand.PlanRegion
Creates a plan region within a view.

Autodesk.Revit.UI.PostableCommand.ParametersService
Use the Parameters Service to manage shared parameters and import them into a Revit session.

Autodesk.Revit.UI.PostableCommand.PublishCoordinates
Determines the coordinates used in the current model, and uses them for a linked model.

Autodesk.Revit.UI.PostableCommand.SelectById
Uses an element's unique identifier to locate and select the element in the current view.

Autodesk.Revit.UI.PostableCommand.IdsOfSelection
Displays unique identifiers for the selected elements.

Autodesk.Revit.UI.PostableCommand.ReportSharedCoordinates
Displays shared coordinates of a linked model within a host model.

Autodesk.Revit.UI.PostableCommand.AcquireCoordinates
Determines the coordinates used in a linked project, and uses them for the current project.

Autodesk.Revit.UI.PostableCommand.Location
Specifies the geographic location for the project.

Autodesk.Revit.UI.PostableCommand.DuplicateWithDetailing
Creates a view that includes model geometry and view-specific elements from the current view.

Autodesk.Revit.UI.PostableCommand.RotateTrueNorth
Changes the angle for a project relative to True North.

Autodesk.Revit.UI.PostableCommand.RelocateProject
Moves the model relative to the shared coordinate system.

Autodesk.Revit.UI.PostableCommand.ProjectParameters
Specifies parameters that can be added to categories of elements in a project, and used in schedules.

Autodesk.Revit.UI.PostableCommand.ExportImagesandAnimationsImage
Saves animations or image files.

Autodesk.Revit.UI.PostableCommand.LinkRevit
Links another Revit model to the current model.

Autodesk.Revit.UI.PostableCommand.ThinLines
Displays all lines on screen as a single width, regardless of zoom level.

Autodesk.Revit.UI.PostableCommand.SplitWithGap
Splits a wall, pipe, duct, cable tray, conduit, structural framing or a column into 2 segments with a defined gap.

Autodesk.Revit.UI.PostableCommand.LabelContours
Displays the elevations of contour lines.

Autodesk.Revit.UI.PostableCommand.RebarLine
Defines lines and geometry of the rebar shape.

Autodesk.Revit.UI.PostableCommand.TitleBlock
Creates a title block element in a sheet view.

Autodesk.Revit.UI.PostableCommand.PlaceDecal
Places an image on surfaces of a building model for rendering.

Autodesk.Revit.UI.PostableCommand.PurgeUnused
Removes unused families and types from a project.

Autodesk.Revit.UI.PostableCommand.Offset
Copies or moves a selected element (such as a line, wall, or beam) a specified distance perpendicular to its length.

Autodesk.Revit.UI.PostableCommand.LegendComponent
Adds a graphic representation of a selected model element to a legend view.

Autodesk.Revit.UI.PostableCommand.SharedParameters
Specifies parameters that can be used in multiple families and projects.

Autodesk.Revit.UI.PostableCommand.TagAllNotTagged
Adds tags to multiple elements in one step.

Autodesk.Revit.UI.PostableCommand.SwitchJoinOrder
Changes the order in which elements join with one another.

Autodesk.Revit.UI.PostableCommand.UnjoinGeometry
Removes a join between 2 or more elements.

Autodesk.Revit.UI.PostableCommand.JoinGeometry
Creates clean joins between 2 or more host elements that share a common face, such as walls and floors.

Autodesk.Revit.UI.PostableCommand.Area
Creates an area defined by walls and boundary lines.

Autodesk.Revit.UI.PostableCommand.AreaBoundary
Defines boundaries for areas.

Autodesk.Revit.UI.PostableCommand.AreaTag
Tags the selected area.

Autodesk.Revit.UI.PostableCommand.CloseInactiveViews
Closes open views except for the currently active view. The current view remains open in the drawing area.

Autodesk.Revit.UI.PostableCommand.ExportReportsSchedule
Saves a schedule or Room/Area report.

Autodesk.Revit.UI.PostableCommand.CutProfile
Changes the shape of elements that are cut in a view, such as roofs, walls, floors, and the layers of compound structures.

Autodesk.Revit.UI.PostableCommand.SymbolicLine
Creates lines that are meant for symbolic purposes only, and are not part of the actual geometry of the component or building model.

Autodesk.Revit.UI.PostableCommand.TransferProjectStandards
Copies selected project settings from another open project to the current project.

Autodesk.Revit.UI.PostableCommand.ParkingComponent
Adds parking spaces to a topography.

Autodesk.Revit.UI.PostableCommand.SaveAsLibraryGroup
Saves a copy of all loaded families, the selected family, group, or view to your library.

Autodesk.Revit.UI.PostableCommand.LoadAsGroup
Loads a Revit file as a group.

Autodesk.Revit.UI.PostableCommand.ExportODBCDatabase
Saves model data to an ODBC database.

Autodesk.Revit.UI.PostableCommand.RestoreBackup
Rolls back changes made to a workshared project, or saves a selected backup version to be the current working model.

Autodesk.Revit.UI.PostableCommand.SplitFace
Divides the face of an element (such as a wall or floor) into regions for the application of different materials.

Autodesk.Revit.UI.PostableCommand.CreateTemplateFromCurrentView
Creates a view template using the properties of the current view as the basis for the new template.

Autodesk.Revit.UI.PostableCommand.ManageViewTemplates
Displays parameters for view templates in the project.

Autodesk.Revit.UI.PostableCommand.RemoveHiddenLinesByElement
Removes hidden lines for model elements and detail elements that are obscured by other elements in the active view only.

Autodesk.Revit.UI.PostableCommand.ShowHiddenLinesByElement
Displays hidden lines for individual model elements and detail elements that are obscured by other elements in the current view.

Autodesk.Revit.UI.PostableCommand.ModelText
Adds 3D text to the building model.

Autodesk.Revit.UI.PostableCommand.NoteBlock
Creates a schedule of annotations added using the Symbol tool.

Autodesk.Revit.UI.PostableCommand.RemovePaint
Removes paint from selected faces.

Autodesk.Revit.UI.PostableCommand.Paint
Applies a material to the face of an element.

Autodesk.Revit.UI.PostableCommand.SweepWall
Creates a wall sweep by extruding a profile along a path.

Autodesk.Revit.UI.PostableCommand.RevealWall
Extrudes a profile along a path to create a cutout in a wall.

Autodesk.Revit.UI.PostableCommand.ApplyTemplatePropertiesToCurrentView
Applies properties stored in a view template to the current view.

Autodesk.Revit.UI.PostableCommand.ManageImages
Lists all raster images used in the project.

Autodesk.Revit.UI.PostableCommand.GradedRegion
Modifies topography to indicate changes during the construction process.

Autodesk.Revit.UI.PostableCommand.AreaPlan
Creates an area plan view.

Autodesk.Revit.UI.PostableCommand.SheetList
Creates a schedule that lists the drawings in the project.

Autodesk.Revit.UI.PostableCommand.ModelInPlace
Creates a component that is unique to the project.

Autodesk.Revit.UI.PostableCommand.ProjectInformation
Specifies basic information about the project, including the project status and client information.

Autodesk.Revit.UI.PostableCommand.SynchronizeAndModifySettings
Allows you to specify options for the synchronization operation.

Autodesk.Revit.UI.PostableCommand.RevisionCloud
Adds a revision cloud to the current view or sheet to indicate design areas that have changed.

Autodesk.Revit.UI.PostableCommand.Demolish
Marks elements as demolished in the current phase.

Autodesk.Revit.UI.PostableCommand.Legend
Creates a list of building components and annotations used in a project.

Autodesk.Revit.UI.PostableCommand.DraftingView
Creates a view showing details that are not directly associated with the building model.

Autodesk.Revit.UI.PostableCommand.SetWorkPlane
Specifies the work plane for the current view or for a selected work-plane-based element.

Autodesk.Revit.UI.PostableCommand.Linework
Overrides the line style for a selected line in the active view only.

Autodesk.Revit.UI.PostableCommand.ScopeBox
Controls the visibility of datum elements (grids, levels, and reference planes) in specific views.

Autodesk.Revit.UI.PostableCommand.MatchTypeProperties
Converts one or more elements to match the type of another element in the same view.

Autodesk.Revit.UI.PostableCommand.ImportPDF
Inserts a PDF file into a model view to use as a background image or visual aid.

Autodesk.Revit.UI.PostableCommand.ImportImage
Imports a raster image into a Revit project to use as a background image or visual aid during the creation or presentation of the model.

Autodesk.Revit.UI.PostableCommand.PropertyLine
Creates a property line in a plan view.

Autodesk.Revit.UI.PostableCommand.Phases
Specifies project phases, phase filters, and graphic overrides for phases.

Autodesk.Revit.UI.PostableCommand.Worksets
Creates worksets and adds elements to them.

Autodesk.Revit.UI.PostableCommand.CreateSimilar
Places an element of the same type as the selected element

Autodesk.Revit.UI.PostableCommand.Insulation
Places a batt insulation graphic in a detail view.

Autodesk.Revit.UI.PostableCommand.DetailLine
Creates view-specific lines.

Autodesk.Revit.UI.PostableCommand.DetailComponent
Adds a view-specific detail component to a view.

Autodesk.Revit.UI.PostableCommand.OverrideByCategory
Changes the graphic display settings for all elements that belong to the same category as the selected element in the current view.

Autodesk.Revit.UI.PostableCommand.PlaceDetailGroup
Places an instance of a detail group in the view.

Autodesk.Revit.UI.PostableCommand.UncutGeometry
Selects which geometry does not get cut when you join geometry.

Autodesk.Revit.UI.PostableCommand.CutGeometry
Selects the geometry to cut.

Autodesk.Revit.UI.PostableCommand.VoidSweep
Creates a 3D shape by sweeping a 2D profile along a path, and uses the resulting 3D shape to remove part of a solid 3D shape.

Autodesk.Revit.UI.PostableCommand.VoidRevolve
Creates a 3D shape by sweeping a 2D profile around an axis, and uses the 3D shape to remove part of a solid 3D shape.

Autodesk.Revit.UI.PostableCommand.VoidBlend
Creates a 3D blend, which is then used to remove part of a solid 3D shape.

Autodesk.Revit.UI.PostableCommand.VoidExtrusion
Creates a 3D shape that is then used to remove part of a solid 3D shape.

Autodesk.Revit.UI.PostableCommand.DetailLevel
Specifies the detail level (coarse, medium, or fine) that applies to each view scale by default.

Autodesk.Revit.UI.PostableCommand.ReflectedCeilingPlan
Creates a reflected ceiling plan view.

Autodesk.Revit.UI.PostableCommand.LineStyles
Creates or modifies line styles.

Autodesk.Revit.UI.PostableCommand.AlignmentStationLabelTypes
Defines attributes for Alignment Station Labels.

Autodesk.Revit.UI.PostableCommand.ReviewWarnings
Displays a list of messages that you can ignore or resolve.

Autodesk.Revit.UI.PostableCommand.SpotCoordinateTypes
Defines attributes for spot coordinates.

Autodesk.Revit.UI.PostableCommand.SpotElevationTypes
Defines attributes for spot elevations.

Autodesk.Revit.UI.PostableCommand.Arrowheads
Specifies line weights, fills, and styles for annotation arrowheads.

Autodesk.Revit.UI.PostableCommand.SpotSlopeTypes
Defines attributes for spot slopes.

Autodesk.Revit.UI.PostableCommand.AlignedToSamePlace
Pastes the elements to the same place from which they were cut or copied.

Autodesk.Revit.UI.PostableCommand.NewAnnotationSymbol
Creates a tag or symbol to identify elements in the project.

Autodesk.Revit.UI.PostableCommand.LoadedTagsAndSymbols
Lists the tags and symbols that will be used for each element category.

Autodesk.Revit.UI.PostableCommand.AlignedToSelectedViews
Pastes selected elements, including view-specific elements such as dimensions, into specified views.

Autodesk.Revit.UI.PostableCommand.TagByCategory
Attaches a tag to an element based on the element category.

Autodesk.Revit.UI.PostableCommand.AlignedToSelectedLevels
Pastes multiple elements from one level to specified levels.

Autodesk.Revit.UI.PostableCommand.StartingView
Specifies the view that first displays when you open the model.

Autodesk.Revit.UI.PostableCommand.WallJoins
Changes how walls join together (butt, miter, square off).

Autodesk.Revit.UI.PostableCommand.AlignedToPickedLevel
Pastes the selected elements into a elevation view or a section view.

Autodesk.Revit.UI.PostableCommand.AlignedToCurrentView
Pastes elements that were cut or copied from another view into the current view.

Autodesk.Revit.UI.PostableCommand.RoomSeparator
Creates a separation line to bound rooms where no walls or other room-bounding elements exist.

Autodesk.Revit.UI.PostableCommand.Ramp
Adds a ramp to the building model.

Autodesk.Revit.UI.PostableCommand.CreateGroup
Creates a group of elements for easy reuse.

Autodesk.Revit.UI.PostableCommand.SolidSweep
Creates a 3D shape by sweeping a 2D profile along a path.

Autodesk.Revit.UI.PostableCommand.Callout
Creates a rectangular callout in the view.

Autodesk.Revit.UI.PostableCommand.ScheduleOrQuantities
Creates a key schedule or a schedule of building components.

Autodesk.Revit.UI.PostableCommand.SolidRevolve
Creates a 3D shape by sweeping a 2D profile around an axis.

Autodesk.Revit.UI.PostableCommand.ManageLinks
Provides options for managing linked files to building models.

Autodesk.Revit.UI.PostableCommand.SolidBlend
Creates a solid 3D shape that changes along its length, blending from a starting shape to an ending shape.

Autodesk.Revit.UI.PostableCommand.JoinOrUnjoinRoof
Connects roofs to other roofs or walls, or reverses a previous join.

Autodesk.Revit.UI.PostableCommand.BuildingElevation
Creates an elevation view.

Autodesk.Revit.UI.PostableCommand.ColorFillLegend
Places a legend in a view to indicate the meanings of color fills for rooms or areas.

Autodesk.Revit.UI.PostableCommand.ExportOptionsExportSetupsDWGOrDXF
Sets export options for CAD.

Autodesk.Revit.UI.PostableCommand.ExportOptionsExportSetupsDGN
Sets export options for CAD.

Autodesk.Revit.UI.PostableCommand.DuplicateView
Creates a view that contains only the model geometry from the current view.

Autodesk.Revit.UI.PostableCommand.Symbol
Places a 2D annotation drawing symbol in the current view.

Autodesk.Revit.UI.PostableCommand.Align
Aligns one or more elements with a selected element.

Autodesk.Revit.UI.PostableCommand.RoomTag
Tags the selected room.

Autodesk.Revit.UI.PostableCommand.FilledRegion
Creates a 2D, view-specific graphic with a fill pattern and a boundary line.

Autodesk.Revit.UI.PostableCommand.FamilyTypes
Allows you to enter parameter values for existing family types, add parameters to the family, or create new types within the family.

Autodesk.Revit.UI.PostableCommand.CurtainWallMullion
Creates a horizontal or vertical mullion on a curtain grid.

Autodesk.Revit.UI.PostableCommand.CurtainGrid
Creates a grid line in a curtain wall or curtain system.

Autodesk.Revit.UI.PostableCommand.Room
Creates a room bounded by model elements (such as walls, floors, and ceilings) and separation lines.

Autodesk.Revit.UI.PostableCommand.Options
Display Revit Options Dialog.

Autodesk.Revit.UI.PostableCommand.DecalTypes
Creates a decal that you can use to place images on surfaces of a building model for rendering.

Autodesk.Revit.UI.PostableCommand.MaterialAssets
Modifies the assets that define a material.

Autodesk.Revit.UI.PostableCommand.DeactivateView
Deactivates the view, so you can no longer change the view from the sheet.

Autodesk.Revit.UI.PostableCommand.Materials
Specifies the materials and associated properties to apply to model elements or families.

Autodesk.Revit.UI.PostableCommand.ActivateView
Enables you to modify the selected view without leaving the sheet.

Autodesk.Revit.UI.PostableCommand.NewProject
Creates a Revit project file.

Autodesk.Revit.UI.PostableCommand.Opening
Creates an opening in a host, such as a wall or ceiling.

Autodesk.Revit.UI.PostableCommand.VisibilityOrGraphics
Overrides the default visibility and graphic display of model elements and annotations in the current view.

Autodesk.Revit.UI.PostableCommand.Label
Creates a label for the annotation symbol.

Autodesk.Revit.UI.PostableCommand.Default3DView
Opens the default orthographic 3D view.

Autodesk.Revit.UI.PostableCommand.FillPatterns
Creates or modifies drafting patterns and model patterns.

Autodesk.Revit.UI.PostableCommand.AutomaticCeiling
Creates a ceiling at a specified distance above the level in which it resides.

Autodesk.Revit.UI.PostableCommand.NewTitleBlock
Opens a template for creating a Title Block family.

Autodesk.Revit.UI.PostableCommand.Text
Adds text annotations (notes) to the current view.

Autodesk.Revit.UI.PostableCommand.PlaceView
Adds a view to a sheet.

Autodesk.Revit.UI.PostableCommand.Copy
Copies selected elements and places them in the specified location in the current view.

Autodesk.Revit.UI.PostableCommand.Move
Moves selected elements to the specified location in the current view.

Autodesk.Revit.UI.PostableCommand.Array
Creates a linear or radial array of selected elements.

Autodesk.Revit.UI.PostableCommand.LinePatterns
Creates or modifies line patterns.

Autodesk.Revit.UI.PostableCommand.TemporaryDimensions
Specifies the placement and component references for temporary dimensions.

Autodesk.Revit.UI.PostableCommand.Filters
Creates a filter to modify the visibility and graphics of elements in views based on element parameters.

Autodesk.Revit.UI.PostableCommand.PickAPlane
Select a plane in the view to define a new workplane.

Autodesk.Revit.UI.PostableCommand.Control
Adds a flip arrow to the view.

Autodesk.Revit.UI.PostableCommand.Undo
Reverses the most recent action

Autodesk.Revit.UI.PostableCommand.Redo
Reverses the effects of the previous UNDO command

Autodesk.Revit.UI.PostableCommand.ReferencePlane
Creates a reference plane using drawing tools.

Autodesk.Revit.UI.PostableCommand.StairPath
Annotates the slope direction and walk line of a stair.

Autodesk.Revit.UI.PostableCommand.ModelLine
Creates a line that exists in 3D space and is visible in all views of a project.

Autodesk.Revit.UI.PostableCommand.PlaceAComponent
Places an element in the building model, based on a selected element type.

Autodesk.Revit.UI.PostableCommand.SolidExtrusion
Creates a 3D solid by extruding a 2D shape (profile).

Autodesk.Revit.UI.PostableCommand.Unpin
Unlocks a model element so it can move.

Autodesk.Revit.UI.PostableCommand.Walkthrough
Creates an animated 3D walkthrough of a model.

Autodesk.Revit.UI.PostableCommand.Pin
Locks a model element in place.

Autodesk.Revit.UI.PostableCommand.LoadAutodeskFamily
Load an Autodesk family from the cloud.

Autodesk.Revit.UI.PostableCommand.NewConceptualMass
Opens a template for creating a conceptual massing model.

Autodesk.Revit.UI.PostableCommand.LoadShapes
Loads a Revit family into the current file.

Autodesk.Revit.UI.PostableCommand.NewFamily
Creates a set of custom components to use in projects.

Autodesk.Revit.UI.PostableCommand.PointCloud
Links a Point Cloud file (*.rcp or *.rcs) into the current project.

Autodesk.Revit.UI.PostableCommand.LinkCAD
Links a CAD file to the current Revit project.

Autodesk.Revit.UI.PostableCommand.ImportCAD
Imports data or 3D geometry from other CAD programs to a Revit model or family.

Autodesk.Revit.UI.PostableCommand.NewSheet
Creates a page for a document set.

Autodesk.Revit.UI.PostableCommand.ProjectBrowser
Displays the Project Browser.

Autodesk.Revit.UI.PostableCommand.Camera
Creates a 3D view from the perspective of a camera placed in the view.

Autodesk.Revit.UI.PostableCommand.Section
Creates a section view.

Autodesk.Revit.UI.PostableCommand.FloorPlan
Creates a floor plan view.

Autodesk.Revit.UI.PostableCommand.StructuralPlan
Creates a structural plan view.

Autodesk.Revit.UI.PostableCommand.ProjectUnits
Specifies the display format for units of measure.

Autodesk.Revit.UI.PostableCommand.Snaps
Specifies snap increments, and enables or disables snap points.

Autodesk.Revit.UI.PostableCommand.AnalysisDisplayStyles
Specifies a presentation format for visualizing analysis results.

Autodesk.Revit.UI.PostableCommand.ObjectStyles
Specifies line weights, colors, and patterns, and materials for model objects, annotation objects, and imported objects.

Autodesk.Revit.UI.PostableCommand.LineWeights
Creates or modifies line weights.

Autodesk.Revit.UI.PostableCommand.MirrorPickAxis
Reverses the position of selected elements, using an existing line or edge as the mirror axis.

Autodesk.Revit.UI.PostableCommand.Rotate
Rotates selected elements around an axis.

Autodesk.Revit.UI.PostableCommand.RotateProjectNorth
Changes the relationship of elements relative to Project North (the top of the drawing area) in plan views.

Autodesk.Revit.UI.PostableCommand.MirrorProject
Flips the position of a project around a selected axis.

Autodesk.Revit.UI.PostableCommand.ArchitecturalColumn
Adds architectural columns to the building model.

Autodesk.Revit.UI.PostableCommand.Stair
Adds a stair to the building model by creating common run, landing, and support components.

Autodesk.Revit.UI.PostableCommand.ArchitecturalFloor
Creates a floor for the current level of the building model.

Autodesk.Revit.UI.PostableCommand.FramingElevation
Creates a framing elevation to show vertical bracing.

Autodesk.Revit.UI.PostableCommand.Level
Adds a level to the model.

Autodesk.Revit.UI.PostableCommand.TypeProperties
Displays properties for the family type to which the selected element belongs.

Autodesk.Revit.UI.PostableCommand.SpaceSeparator
Draws a space separation line to divide space.

Autodesk.Revit.UI.PostableCommand.SpaceTag
Labels spaces in a project.

Autodesk.Revit.UI.PostableCommand.Space
Places analytical spaces to account for the entire volume within the model. This includes rooms, plenums and chases.

Autodesk.Revit.UI.PostableCommand.Delete
Removes selected elements from the building model.

Autodesk.Revit.UI.PostableCommand.Window
Adds windows to the building model.

Autodesk.Revit.UI.PostableCommand.Door
Adds doors to the building model.

Autodesk.Revit.UI.PostableCommand.ArchitecturalWall
Creates a non-structural wall in the building model.

Autodesk.Revit.UI.PostableCommand.Grid
Places column grid lines in the building design.

Autodesk.Revit.UI.PostableCommand.SunSettings
Specifies the location of the sun for solar studies, walkthroughs, and rendered images.

Autodesk.Revit.UI.PostableCommand.ExportImagesandAnimationsSolarStudy
Saves animations or image files.

Autodesk.Revit.UI.PostableCommand.ExportImagesandAnimationsWalkthrough
Saves animations or image files.

Autodesk.Revit.UI.PostableCommand.FamilyCategoryAndParameters
Assigns the properties of a predefined family category to the component you are creating.

Autodesk.Revit.UI.PostableCommand.ReinforcementNumbers
Defines or edits numbering sequences by partition for rebar and fabric sheets.

Autodesk.Revit.UI.PostableCommand.StatusBarDesignOptions
Displays the active design option in the status bar.

Autodesk.Revit.UI.PostableCommand.StatusBarWorksets
For a workshared project, displays the active workset and the number of Others' pending Editing Requests in the status bar.

Autodesk.Revit.UI.PostableCommand.TogglePropertiesPalette
Displays or hides a palette where you can view and edit instance properties.

Autodesk.Revit.UI.PostableCommand.ShapeStatus
When enabled, this button indicates that the rebar shape is not valid.

Autodesk.Revit.UI.PostableCommand.BottomChord
Draws the bottom chord of the truss family.

Autodesk.Revit.UI.PostableCommand.TopChord
Draws the top chord of the truss family.

Autodesk.Revit.UI.PostableCommand.Web
Draws the web elements between the chords.

Autodesk.Revit.UI.PostableCommand.KeynotingSettings
Specifies the location of the keynote table and the numbering method for keynotes.

Autodesk.Revit.UI.PostableCommand.KeynoteLegend
Creates a list of the keynotes used in a project, and their definitions.

Autodesk.Revit.UI.PostableCommand.OpenIFCOptions
Sets options for the IFC template and class mapping.

Autodesk.Revit.UI.PostableCommand.ExportExportTypes
Exports family types from the current family to a text (.txt) file.

Autodesk.Revit.UI.PostableCommand.ImportTypes
Imports family types from a text (.txt) file into the current family.

Autodesk.Revit.UI.PostableCommand.DWFMarkup
Links marked-up DWF files into a Revit project so you can see the markups on corresponding sheets.

Autodesk.Revit.UI.PostableCommand.MaterialTakeoff
Creates a list of the sub-components or materials of any Revit family category.

Autodesk.Revit.UI.PostableCommand.RelinquishAllMine
Releases ownership of worksets and borrowed elements that have not been changed.

Autodesk.Revit.UI.PostableCommand.OpenIFC
Opens an IFC file.

Autodesk.Revit.UI.PostableCommand.ExportCADFormatsOBJ
Creates DWG, DXF, DGN, OBJ, SAT, STL or STEP files.

Autodesk.Revit.UI.PostableCommand.ExportCADFormatsSTL
Creates DWG, DXF, DGN, OBJ, SAT, STL or STEP files.

Autodesk.Revit.UI.PostableCommand.ExportPDF
Creates PDF files.

Autodesk.Revit.UI.PostableCommand.ExportCADFormatsACIS_SAT
Creates DWG, DXF, DGN, OBJ, SAT, STL or STEP files.

Autodesk.Revit.UI.PostableCommand.ExportCADFormatsDGN
Creates DWG, DXF, DGN, OBJ, SAT, STL or STEP files.

Autodesk.Revit.UI.PostableCommand.ExportCADFormatsDXF
Creates DWG, DXF, DGN, OBJ, SAT, STL or STEP files.

Autodesk.Revit.UI.PostableCommand.ExportCADFormatsDWG
Creates DWG, DXF, DGN, OBJ, SAT, STL or STEP files.

Autodesk.Revit.UI.PostableCommand.ExportDWFOrDWFx
Creates DWF or DWFx files.

Autodesk.Revit.UI.PostableCommand.ExportCADFormatsSTEP
Creates DWG, DXF, DGN, OBJ, SAT, STL or STEP files.

Autodesk.Revit.UI.PostableCommand.SystemBrowser
Displays the System Browser. Displays a hierarchical list of all the components in each discipline in a project, either by system or by zone.

Autodesk.Revit.UI.PostableCommand.ExportIFC
Creates IFC files.

Autodesk.Revit.UI.PostableCommand.SpecifyCoordinatesAtPoint
Relocates a model and rotates the model to True North by specifying coordinates for North/South, East/West, and Elevation.

Autodesk.Revit.UI.PostableCommand.RunInterferenceCheck
Locates invalid intersections between elements in a project.

Autodesk.Revit.UI.PostableCommand.HideCategory
Hides all elements that belong to a selected category in the current view.

Autodesk.Revit.UI.PostableCommand.FloorByFaceFloor
Converts a mass floor into a floor of the building model.

Autodesk.Revit.UI.PostableCommand.SectionTags
Specifies the shape of heads and tails for section tags.

Autodesk.Revit.UI.PostableCommand.ElevationTags
Defines properties for elevation tags.

Autodesk.Revit.UI.PostableCommand.CalloutTags
Specifies the callout head for callout tags, and the radius of the callout bubble.

Autodesk.Revit.UI.PostableCommand.RevisionSchedule
Adds a revision schedule to a custom title block.

Autodesk.Revit.UI.PostableCommand.SheetIssuesOrRevisions
Specifies revision information for the project.

Autodesk.Revit.UI.PostableCommand.ExportReportsRoomOrAreaReport
Saves a schedule or Room/Area report.

Autodesk.Revit.UI.PostableCommand.ImportGBXML
Imports analysis data from a gbXML file.

Autodesk.Revit.UI.PostableCommand.DrawOnWorkPlane
Draws lines on the active work plane.

Autodesk.Revit.UI.PostableCommand.DrawOnFace
Draws lines on existing surfaces.

Autodesk.Revit.UI.PostableCommand.GrayInactiveWorksets
Displays elements in inactive worksets as gray to visually distinguish them from elements in active worksets.

Autodesk.Revit.UI.PostableCommand.ShowHistory
Displays a list of all the times a workshared file (the central model or a local copy of the central model) was saved and who saved it.

Autodesk.Revit.UI.PostableCommand.Render
Creates a photorealistic image of a building model.

Autodesk.Revit.UI.PostableCommand.ReloadLatest
Loads updates from the central model to your local copy of the project.

Autodesk.Revit.UI.PostableCommand.RadialDimensionTypes
Defines attributes for radial dimensions.

Autodesk.Revit.UI.PostableCommand.RoofByExtrusion
Creates a roof by extruding a profile that you sketch.

Autodesk.Revit.UI.PostableCommand.RoofByFootprint
Creates a roof using the building footprint to define its boundaries.

Autodesk.Revit.UI.PostableCommand.AlignmentStationSet
Add a series of alignment station annotations.

Autodesk.Revit.UI.PostableCommand.AlignmentStation
Add an individual alignment station annotation.

Autodesk.Revit.UI.PostableCommand.SpotCoordinate
Displays the North/South and East/West coordinates of points in a project.

Autodesk.Revit.UI.PostableCommand.SpotElevation
Displays the elevation of a selected point.

Autodesk.Revit.UI.PostableCommand.SplitElement
Cuts an element into separate individual elements.

Autodesk.Revit.UI.PostableCommand.AngularDimensionTypes
Defines attributes for angular dimensions.

Autodesk.Revit.UI.PostableCommand.LinearDimensionTypes
Defines attributes for linear (horizontal and vertical) dimensions.

Autodesk.Revit.UI.PostableCommand.ViewList
Creates a schedule of the views in the project.

Autodesk.Revit.UI.PostableCommand.ShowWarningsInViews
Select to show structural connection warning marks in your project views. Deselect to hide warning marks.

Autodesk.Revit.UI.PostableCommand.StructuralConnection
Adds a structural connection to structural elements.

Autodesk.Revit.UI.PostableCommand.ConnectionSettings
Opens the Structural Connections Settings dialog in which you can load and unload add-in connections into Revit. If no add-ins are present, no connections are available in the Connections tab.

Autodesk.Revit.UI.PostableCommand.RepeatComponent
Repeats the selected applied component along a divide path or surface.

Autodesk.Revit.UI.PostableCommand.LoadIntoProject
Loads the rebar shape into open projects or family files.

Autodesk.Revit.UI.PostableCommand.LoadAsGroupIntoOpenProjects
Loads the current project as a group into another open project or family.

Autodesk.Revit.UI.PostableCommand.Soffit
Creates a roof soffit in the building model.

Autodesk.Revit.UI.PostableCommand.RoofByFace
Creates an element using a non-vertical face of a mass.